%Генерируем случайную величину по НОРМАЛЬНОМУ ЗРВ
function [X, Y] = generateRandom(classes, attributes, range, count)
%range - диапазон случайной величины
%count - количество наблюдений для iого класса
%classes - количество классов
%attribute - количество признаков 
%---------------------------------------------------------
%Нормальное распределение
%R = normrnd(MU,SIGMA,M,N) 
%возвращает матрицу M х N  чисел с параметрами 
%MU (математическое ожидание),SIGMA (дисперсия)
%---------------------------------------------------------
%Генерация массива исходных данных
   for i=1:classes
    X(1+count*(i-1):i*count,:)=normrnd(0,1,count,attributes)+i*range;
   end
   X=normc(X)
%--------------------------------------------------------- 
%Генерировать вектор классификации
   for i=1:classes
        Y(1+count*(i-1):i*count,:)=i;
   end
end
